{
 "absolute_value": 0,
 "align_labels_right": 0,
 "creation": "2025-11-28 14:22:06.492444",
 "custom_format": 1,
 "default_print_language": "en",
 "disabled": 0,
 "doc_type": "Loan Application",
 "docstatus": 0,
 "doctype": "Print Format",
 "font_size": 14,
 "html": "<!DOCTYPE html>\n<html>\n<head>\n    <style>\n        body {\n            font-family: Arial, sans-serif;\n            line-height: 1.4;\n            margin: 0;\n            padding: 0;\n            background-color: white;\n        }\n        .page-container {\n            display: flex;\n            width: 100%;\n            border: 2px solid #000;\n            padding: 8px;   /* REDUCED PADDING */\n            margin: 10px;\n            box-sizing: border-box;\n            min-height: 100vh;\n        }\n        .left-column {\n            width: 50%;\n            padding: 8px;   /* REDUCED */\n            box-sizing: border-box;\n        }\n        .right-column {\n            width: 50%;\n            padding: 8px;   /* REDUCED */\n            box-sizing: border-box;\n        }\n        .header {\n            text-align: center;\n            font-weight: bold;\n            margin-bottom: 20px;\n            font-size: 1.1em;\n        }\n        .clause {\n            margin-bottom: 15px;\n            text-align: justify;\n            font-size: 0.70em;\n        }\n        .signature-block {\n            margin-top: 40px;\n            width: 100%;\n        }\n        .signature-line {\n            display: inline-block;\n            width: 24%;\n            vertical-align: top;\n            margin-right: 1%;\n        }\n        .signature-line:last-child {\n            margin-right: 0;\n        }\n        .signature-line p {\n            border-top: 1px solid #000;\n            margin-top: 50px;\n            padding-top: 5px;\n            text-align: center;\n            font-size: 0.9em;\n        }\n        .witness-block {\n            margin-top: 20px;\n            width: 100%;\n        }\n        .witness-line {\n            display: inline-block;\n            width: 24%;\n            vertical-align: top;\n            margin-right: 1%;\n        }\n        .witness-line:last-child {\n            margin-right: 0;\n        }\n        .witness-line p {\n            border-top: 1px solid #000;\n            margin-top: 50px;\n            padding-top: 5px;\n            text-align: center;\n            font-size: 0.9em;\n        }\n        .blank-line {\n            display: inline-block;\n            border-bottom: 1px solid #000;\n            min-width: 100px;\n            margin: 0 5px;\n        }\n        @media print {\n            body {\n                margin: 0;\n                padding: 0;\n            }\n            .page-container {\n                border: 2px solid #000;\n                margin: 0;\n                page-break-after: always;\n            }\n        }\n    </style>\n</head>\n<body>\n\n<div class=\"page-container\">\n    <!-- Left Column -->\n    <div class=\"left-column\">\n        <div class=\"header\">\n            <strong>GROUP LOAN AGREEMENT version jan 24</strong>\n        </div>\n\n        <div class=\"clause\">\n            This loan agreement along with its annexures, applications, addendums and schedules (together known as the \"Agreement\") is executed at the place and on the date mentioned below in favour of <strong>TEJRAJ MICRO ASSOCIATION</strong>, a company incorporated under the provisions of the Companies Act, 2013 (CIN: U88900MH2023NPL405072),with its Registered Office at Plot No 72, Gat No 130, Arunoday Colony, deolai Chowk, Near Datta Mandir, Chh. Sambahjinagar(Aurangabad),Maharashtra -- 431 001 (hereinafter referred to as \"<strong>TMA</strong>\")\n        </div>\n\n        <div class=\"clause\">\n            BY\n        </div>\n\n        <div class=\"clause\">\n            The borrower, whose name, address and other details are set out in the Loan Application as provided in the schedule overleaf (hereinafter referred to as \"Borrower\") The expressions \"TMA\" and \"Borrower\" unless repugnant to the context or meaning thereof shall include, in regard to TMA its assigns and successors in interest and in respect of Borrower his/her legal heirs, executors, administrators, representatives etc. \"TMA\" and \"Borrower\", where the context so requires, are referred individually as \"Party\" and collectively as \"Parties\". The \"Terms and Conditions Governing Group Loan Agreement (Micro Banking)\" containing 27 Clauses (\"the T&C\") received by the Borrower from TMA before execution of this Agreement shall also be deemed as part of this Agreement, and the capitalised terms mentioned herein shall have the same meaning assigned to them in the T&C.\n        </div>\n\n        <div class=\"clause\">\n            Whereas the Borrower has approached TMA for the Borrower's business requirements and on the basis of the Application Form and representation from the Borrower, TMA has agreed to lend and to advance to the Borrower, a Loan on the terms and conditions as set out in the Facility Documents.\n        </div>\n\n        <div class=\"clause\">\n            NOW, THEREFORE THIS AGREEMENT WITNESSETH AND IT IS HEREBY AGREED BY AND BETWEEN THE PARTIES HERETO AS FOLLOWS:\n        </div>\n\n        <div class=\"clause\">\n            <strong>1.</strong> The Borrower is the sole person applying for, accepting, eligible and receiving the Loan under this Agreement.\n        </div>\n\n        <div class=\"clause\">\n            <strong>2.</strong> The Loan or Top-Up-Loan may be disbursed by TMA to the Borrower by way of account credit and such disbursement shall be deemed as disbursed on the date the proceeds of the Loan or Top-Up-Loan (as the case be) are actually credited to any account of the Borrower, irrespective of whether the disbursement date and/or date of receipt of credit in the account falls a Public Holiday. The Borrower shall pay Interest on the Loan from the said date and also repay the Loan accordingly. The Borrower is aware and acknowledges that the Interest shall be benchmarked to MCLR or EBLR (as per the prevailing guidelines of TMA) and the actual Interest rate shall be a component of MCLR or EBLR (of appropriate tenure) plus applicable spread. TMA is authorized to revise the rate of Interest in accordance with change in the law and/or regulatory requirements by the regulator applicable to the Loan pertaining to provisioning norms and/or risk weightage or based on the changes in the pricing policy of TMA.\n        </div>\n\n        <div class=\"clause\">\n            <strong>3.</strong> The Borrower shall repay the Loan, in PI, comprising of principal and applicable rate of Interest. The charges and expenses incurred by TMA shall be reimbursed by the Borrower forthwith upon TMA incurring the same, and all such charges and expenses not reimbursed shall form part of principal amount under the Loan, and shall be repaid by the Borrower accordingly.\n        </div>\n\n        <div class=\"clause\">\n            <strong>4.</strong> The Borrower will repay the Loan in instalments as per the choice opted and as mentioned in the loan card/the schedule overleaf. The Borrower may pre-close the Loan at any time during its subsistence without any additional charges therefor.\n        </div>\n\n        <div class=\"clause\">\n            <strong>5.</strong> The Borrower agrees that each of the Representations and Warranties mentioned in the T&C shall be deemed to have repeated by him/her on continuing basis till closure of the Loan.\n        </div>\n\n        <div class=\"clause\">\n            <strong>6.</strong> The Parties shall try to settle any dispute, difference, claims through negotiation and conciliation between the Parties inter-se. If no settlement could be arrived within the period of 15 (Fifteen) days, then the dispute shall be referred to arbitration under the provisions of the Arbitration and Conciliation Act, 1996 or any re-enactment thereof to be conducted by a single arbitrator nominated by TMA whose decision shall be final and binding on the Parties. The arbitral proceedings shall be held at Chh.\n        </div>\n    </div>\n\n    <!-- Right Column -->\n    <div class=\"right-column\">\n        <div class=\"clause\">\n            Sambhajinagar. Any or all disputes arising out of this Agreement shall be subjected to the sole and exclusive jurisdiction of the Civil Courts at Chh. Sambhajinagar, Maharashtra. The Borrower agrees that TMA may, in its absolute discretion commence any legal action or proceedings in any other court, tribunal or other appropriate forum and the Borrower hereby consents to that jurisdiction.\n        </div>\n\n        <div class=\"clause\">\n            <strong>7.</strong> The Parties agree that this Agreement shall constitute the basis of valid and binding lender -- borrower relationship between TMA and the Borrower respectively and shall continue to subsist for the period of 3 (Three) months either from the date of termination or full and final repayment of any Loan provided under the terms of this Agreement or any of its schedules / annexures /addendums thereof.\n        </div>\n\n        <div class=\"clause\">\n            <strong>8.</strong> TMA shall have rights to place the Loan, along with any accrued Interest under moratorium or any other agreement as it may deem fit on a case to case basis.\n        </div>\n\n        <div class=\"clause\">\n            <strong>9.</strong> The Borrower hereby irrevocably authorizes TMA to grant need based restructuring/rescheduling of Loan (by enlarging the tenure or by postponing the mature date of the Loan, and by keeping the PI unaltered) in case TMA is of the view that the Borrower has been affected by natural calamity or national disaster. The Borrower authorizes TMA to consider such restructuring/rescheduling of Loan only at the pure discretion of TMA. If the Loan is restructured/rescheduled in any manner whatsoever, the Borrower shall conduct the Loan account as per the terms and conditions governing such restructure/reschedule. Such restructuring/rescheduling of Loan by TMA shall not constitute any waiver of rights vested on TMA or obligations of the Borrower under the existing Loan. Further, despite such restructuring/rescheduling TMA shall have the right to recover the Outstandings on the existing Loan as per the covenants in this Loan Agreement.\n        </div>\n\n        <div class=\"clause\">\n            <strong>10.</strong> The Borrower confirms having received a copy of the T&C, and agrees to be bound by all the conditions and obligations laid down in this Agreement (including the schedule and the T&C).\n        </div>\n\n        <div class=\"clause\">\n            <strong>11.</strong> If borrower has availed the credit facility (\"Loan\") from TEJRAJ MICRO ASSOCIATION, under the Joint Liability Group (JLG) loan program borrower shall be jointly and severally liable to repay the loan along with interest thereon and other charges/ cost/ expenses as specified in the loan application and other related documents (collectively referred as \"Loan Document\").\n        </div>\n\n        <div class=\"clause\">\n            <strong>12.</strong> This Agreement shall be executed in one set and the original shall be held by TMA and a copy thereof shall be retained by Borrower for the record and reference purpose. The Borrower shall get the entries of repayments made by him/her countersigned by the person collecting the repayment amount on behalf of TMA on the schedule appearing on such copy, which will serve as acknowledgement of receipt of repayment amount. The Borrower hereby expressly acknowledges and confirms that he/she has been read over the material details including but not limited to the Loan, the Agreement (including the schedule overleaf) and the T&C, in ________________ language known to him/her, and he/she has verified, understood and agree and acknowledge and record his/her signatures in token of acceptance of/agreement to the same. IN WITNESS WHEREOF the Parties have signed this Agreement (including the schedule overleaf) in acceptance of all terms and conditions on this (Date)________________ at (Place)_______________________.\n        </div>\n\n<!-- TITLE (NO SIGNATURE LINE) -->\n<style>\n    .signature-line {\n        width: 100%;\n        height: 1px;\n        background: #000;\n        margin-top: 3px;\n        margin-bottom: 3px;\n    }\n</style>\n\n<!-- TITLE (NO SIGNATURE LINE) -->\n<div style=\"display:flex; width:100%; margin-top:10px; text-align:left;\">\n    <div style=\"flex:1;\">\n        <p><strong>For Tejraj Micro Association</strong></p>\n    </div>\n</div>\n<br>\n<!-- BORROWER + CO-BORROWER IN TWO-COLUMN ROWS -->\n<div style=\"display:flex; flex-wrap: wrap; width:100%; margin-top:25px;\">\n\n{% set group_name = doc.loan_group %}\n\n{% set applications = frappe.get_all(\n    \"Loan Application\",\n    filters={\"loan_group\": group_name},\n    fields=[\"name\", \"applicant_name\", \"co_borrower\"]\n) %}\n\n{% for app in applications %}\n    {# --- Borrower Column --- #}\n    <div style=\"flex: 1; min-width: 45%; margin-bottom:15px; text-align:center;\">\n        <p><strong>Borrower</strong></p>\n        <p>{{ app.applicant_name }}</p>\n    </div>\n\n    {# --- Co-Borrower Column --- #}\n    <div style=\"flex: 1; min-width: 45%; margin-bottom:15px; text-align:center;\">\n        {% if app.co_borrower %}\n            {% set cb_list = app.co_borrower.split(\",\") %}\n            {% set cb_doc = frappe.get_doc(\"Loan Member\", cb_list[0].strip()) %}\n            <p><strong>Co-Borrower</strong></p>\n            <p>{{ cb_doc.member_name }}</p>\n        {% else %}\n            <p><strong>Co-Borrower</strong></p>\n            <p>____________________</p>\n        {% endif %}\n    </div>\n{% endfor %}\n\n</div>\n\n\n\n\n<br>\n<!-- AUTHORISED SIGNATORY TITLE -->\n<div style=\"display:flex; width:100%; text-align:left; margin-top:20px;\">\n    <div style=\"flex:1;\">\n         <p></p>\n        <p>Name:</p>\n        <p><strong>Name of Authorised Signatory</strong></p>\n    </div>\n</div>\n\n<!-- AUTHORISED SIGNATORY SIGNATURE ABOVE TITLE -->\n\n<br>\n<!-- SECOND ROW (BORROWER + CO-BORROWER-2 + CO-BORROWER-3) -->\n<div style=\"display:flex; width:100%; text-align:center; margin-top:25px;\">\n    <div style=\"flex:1;\">\n       \n        <p></p>\n        <p>Name:</p>\n        <p><strong>Borrower-1</strong></p>\n    </div>\n\n    <div style=\"flex:1;\">\n        \n        <p></p>\n        <p>Name:</p>\n        <p><strong>Co-Borrower-1</strong></p>\n    </div>\n\n    \n\n\n\n\n</body>\n</html>\n",
 "idx": 0,
 "line_breaks": 0,
 "margin_bottom": 15.0,
 "margin_left": 15.0,
 "margin_right": 15.0,
 "margin_top": 15.0,
 "modified": "2025-11-28 18:36:48.487337",
 "modified_by": "Administrator",
 "module": "Excel Loan Management",
 "name": "GROUP LOAN AGREEMENT version jan 24",
 "owner": "Administrator",
 "page_number": "Hide",
 "pdf_generator": "wkhtmltopdf",
 "print_format_builder": 0,
 "print_format_builder_beta": 0,
 "print_format_for": "DocType",
 "print_format_type": "Jinja",
 "raw_printing": 0,
 "show_section_headings": 0,
 "standard": "Yes"
}