{
 "absolute_value": 0,
 "align_labels_right": 0,
 "creation": "2025-11-28 14:23:30.680922",
 "custom_format": 1,
 "default_print_language": "en",
 "disabled": 0,
 "doc_type": "Loan Application",
 "docstatus": 0,
 "doctype": "Print Format",
 "font_size": 14,
 "html": "<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n    <meta charset=\"UTF-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n    <title>Group Declaration And Terms And Conditions</title>\n\n    <style>\n        * {\n            box-sizing: border-box;\n            margin: 0;\n            padding: 0;\n            font-family: Arial, sans-serif;\n        }\n\n        body {\n            padding: 20px;\n            line-height: 1.0;\n            color: #333;\n            max-width: 1000px;\n            margin: 0 auto;\n            background-color: #f5f5f5;\n            font-size: 8px;   /* ADDED GLOBAL FONT SIZE */\n        }\n\n        .page {\n            background: white;\n            padding: 30px;\n            margin-bottom: 20px;\n            box-shadow: 0 0 10px rgba(0,0,0,0.1);\n            page-break-after: always;\n            border: 1px solid #000;\n            border-radius: 5px;\n        }\n\n        .page:last-of-type {\n            page-break-after: auto;\n        }\n\n        .document-header {\n            display: flex;\n            justify-content: space-between;\n            margin-bottom: 20px;\n           \n            padding-bottom: 10px;\n        }\n\n        .document-title {\n            font-size: 18px;\n            font-weight: bold;\n        }\n\n        .center-number {\n            text-align: left;\n        }\n\n        .date-section {\n            text-align: right;\n        }\n\n        .address-section {\n            margin-bottom: 20px;\n            text-align: left;\n        }\n\n        .section {\n            margin-bottom: 15px;\n        }\n\n        .section-title {\n            font-weight: bold;\n            margin-bottom: 5px;\n        }\n\n        /* Signature Table */\n        .signature-table {\n            width: 100%;               /* FIXED WIDTH */\n            border-collapse: collapse;\n            margin: 20px 0;\n        }\n        .signature-table, .signature-table th, .signature-table td {\n            font-size: 9px;            /* YOUR SIZE */\n            border: 1px solid #000;\n        }\n        .signature-table th, .signature-table td {\n            padding: 8px;\n            text-align: left;\n            vertical-align: top;\n            height: 40px;\n        }\n        .signature-table th {\n            background-color: #f2f2f2;\n        }\n\n        /* Footer alignment */\n        .footer {\n            display: flex;               /* ADDED */\n            justify-content: space-between;  /* ADDED */\n            margin-top: 20px;\n            width: 100%;\n        }\n        .footer-left {\n            text-align: left;\n        }\n        .footer-right {\n            text-align: right;\n        }\n\n        .language-section {\n            margin-top: 20px;\n            font-style: italic;\n        }\n\n        .page-number {\n            text-align: center;\n            margin-top: 20px;\n            font-style: italic;\n            color: #666;\n        }\n\n        @media print {\n            body {\n                padding: 0;\n                background: white;\n            }\n            .page {\n                box-shadow: none;\n                margin-bottom: 0;\n                border: 2px solid #000;\n                border-radius: 0;\n            }\n        }\n    </style>\n</head>\n\n<body1\n    <!-- Page 1 -->\n    <div class=\"page\">\n        <div class=\"document-header\">\n            <div class=\"center-number\">Center Number: _______________</div>\n            <div class=\"date-section\">Date: _______________</div>\n        </div>\n\n        <div class=\"address-section\">\n            <p>To,</p>\n            <p>Tejraj Micro Association,</p>\n            <p>Acting through ________________ Branch</p>\n            <p>(hereinafter \"TMA\")</p>\n        </div>\n\n        <div>\n            <p>Dear Sir/Madam,</p>\n            <p>In consideration of the group loan being evaluated by <strong>TEJRAJ MICRO ASSOCIATION</strong>. (CIN: U88900MH2023NPL405072) (hereinafter \"TMA\") pursuant to the loan application and customer profile form (including data inputted through any electronic device of TMA) (hereinafter the forms) submitted/being submitted by the herein mentioned borrower(s) and with reference to the information provided through the forms, each one of us hereby solemnly declare, state, confirm and authorise as follows:</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">1) (Applicable for borrower(s)):</div>\n            <p>(a) each one of us stands as witness for the other borrower(s) having been sanctioned/having availed loan in their respective names from TMA. (b) i/we have perused/having been explained in the language known to me/us all the fields in the forms, including various declarations contained therein, and l/we am/are aware and acknowledge that the loan application shall be prepared based on the data information inputted therein pursuant to the details orally shared by me/us to the staff of TMA. (c) i/we confirm having read/being explained the terms and conditions governing the loan sought for by me/us, i/we agree to be bound by the same. I/we am/are aware and acknowledge that l/we can have a copy of the said terms and conditions from the branch of TMA by making a specific request. I/we hereby agree that by applying for the loan l/we shall be bound by the said terms and conditions, and l/we irrevocably accept, agree and submit to the same. (d) if anyone among us has availed any group loan and the same is outstanding in the books of TMA, the loan requested for need be disbursed only after closure of such existing loan. If such existing loan is not closed by the respective borrower, TMA is authorised to net-off the dues under such existing loan, from and out of the proceeds of the loan requested for. (e) the loan to be sanctioned will not be used for any purpose other than for which it is sanctioned. (f) each one of us shall be liable to repay to TMA their respective loan, along with principal, interest and other charges, and such repayments shall be made regularly on the respective due dates. In case of default, TMA shall have every right to recall the entire outstanding under the loan along with applicable rate of interest and other charges. (g) except to the extent disclosed to TMA in writing none among us is a director or relative of a director or senior official of TMA or any other bank, and no director or employee of TMA or any other bank or their relative have any substantial interest in the activities carried out by anyone of us. (h) TMA is hereby authorised to disburse proceeds of the loan (after netting-off the dues under existing loan, if any) to our respective bank accounts as per the details provided by each one of us, after deducting the processing fees and insurance premium as applicable. If any of us seeks cancellation of the loan, we shall refund to TMA forthwith the loan amount so transferred. (i) if any information provided through this document does not match with the information already available in the records of TMA, each one of us hereby authorize TMA to update the said information in its records as per the information provided by each one of us through this document.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">2) (Applicable for borrower(s)):</div>\n            <p>If i maintain any savings bank account with TMA, and the same is found dormant at present, i authorize TMA: (a) to convert the savings bank account to inactive/activate by following TMA's processes, (b) link the said saving bank account with my loan account, and (c) disburse the proceeds of the eligible loan amount to the said savings bank account. I affirm that i have been informed about the balance available in the said savings bank account and i confirm correctness of such balance.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">3) (Applicable for borrower(s)):</div>\n            <p>Each one of us solemnly state, declare and undertake that: (a) we have been informed that TMA administers life insurance products through select insurance companies, however it will, under no circumstance, insist anyone of us to avail such insurance coverage. If any one of us wishes to obtain life insurance cover for insuring her/his/spouse's life the same will be done on voluntary basis. At our instance, all of us have been explained/read over the insurance product features, benefits and risk factors, structure of charges, terms and conditions of the insurance products etc. Related to the life insurance products administered by TMA, and each one of us has understood the same. We are fully aware that all matters related to insurance policy (including the insurance premium, eligibility norms, insurance underwriting, issuance of insurance policy, settlement of insurance claims etc.) are subject to terms and conditions of the concerned insurance company. We may pay the applicable premium amount either by depositing with TMA or by authorizing TMA to deduct from and out of the proceeds of the loan, for onward payment to the concerned insurer(s), and we shall get proper receipts therefor; (b) if the loan is eligible for any social welfare scheme or direct benefit transfer scheme of government of india, we shall submit to TMA/uidai our respective aadhaar particulars in the permissible form and also execute requisite further mandate in favour of TMA/UIDAI.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">4) (Applicable for borrower(s)):</div>\n            <p>Each one of us request TMA to: (a) communicate with us through our registered phone number or e-mail ld, our eligibility for any repeat loans and/or additional loans and/or top up loans; (b) negotiate with each one of us (in any mode of communication as deemed appropriate by TMA) the terms and conditions applicable for such repeat loans and/or additional loans and/or top up loans; (c) process the repeat loans and/or additional loans and/or top up loans based on such negotiations; and (d) grant repeat loans and/or additional loans and/or top up loans. Each one of us authorises TMA to record our respective consents, as also the concurrence of each one of us for the applicable terms and conditions, for availing the repeat loans and/or additional loans and/or top up loans in any legally permissible mode (physical or electronic or one way interactive voice response or both way interactive voice response or through recorded synthesised voice or by way of response to sms). Each one of us is aware and acknowledges that there are risks involved in the above mode of communications including the risk that such communication may be intercepted by any person and the same may not be received by the intended recipient. Each one of us agrees that TMA shall not be liable for any loss or damage arising from any such error or delay in any such communication by TMA or its agents, including but not limited to any breach of confidentiality or any pecuniary loss. Each one of us expressly and voluntarily consents for this clause, especially for recording the consent given by each one of us in the above mode.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">5)</div>\n            <p>Each one of us hereby expressly authorises TMA to use my/our contact number and e-mail ld in connection with transactional, promotional and service related calls/messages, and also about other loan products.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">6)</div>\n            <p>each one of us hereby expressly authorises TMA to, without notice to me/us, disclose and/or share all the data/information related to any one of us (including personal sensitive data or information that requires a consent under the applicable laws), and/or the loan availed, and/or the defaults (if any) with its subsidiaries/affiliates, third parties engaged by TMA, regulatory and statutory authorities, any other person to (or through) whom TMA assigns or transfers or novates (including by way of refinance or participation) all or any of its rights under the loan, as and when necessary.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">7) Household Income:</div>\n            <p>Each one of us has shared with TMA our respective annual household income through the forms. Each one of us is aware of the directions issued by the reserve bank of india (\"Rbi\") on regulatory framework for microfinance loans, as per which microfinance loan is defined as a collateral-free loan given to a household having annual household income up to 3,00,000/- (rupees three lakhs only). (the term \"Household\" Shall mean an individual family unit, i.e., husband, wife and their unmarried children.] each one of us is aware that, loan (if any) sanctioned to each one of us shall be qualified for the benefits as applicable to microfinance loan only if our respective household does not exceed the threshold fixed by RBI.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">8) Central KYC:</div>\n            <p>I/we authorize TMA to upload the details provided hereinabove on the central kyc registry. I/we also authorise TMA to download my/our kyc details from the central kyc registry on the basis of the kyc number submitted by me/us. I/we consent to receive information from central kyc registry through sms/e-mail on the herein mentioned mobile number/e-mail id.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">9) Credit Bureau Check:</div>\n            <p>I/we am/are informed about the guidelines issued by the reserve bank of india on regulatory framework for microfinance loans. I/we am/are aware that, for processing the loan application submitted by the borrower, the household income of the borrower should be assessed. Further, TMA shall have to mandatorily submit information n regarding household income to the credit information companies (CICS). Accordingly, the financial standing of each one of us needs to be assessed by TMA. Hence, for the convenience and benefit of the borrower, TMA is hereby authorised to use the data/information shared by each one of us with TMA for credit bureau enquiries. TMA has informed me/us that, subject to the herein mentioned borrower maintaining healthy financial discipline and satisfying the eligibility norms of TMA,TMA may be able to explore possibilities of granting to the borrower at the pure discretion of TMA other/further loan products of TMA,if i/we give consent to access the database of cics or such other repositories. Therefore, l/we hereby expressly give our respective consent to TMA to access the database of CICs or such other repositories, during subsistence of the loan presently applied for by the borrower as also for a period of 60 (sixty) days from the date of closure of the existing loan (if any) of the borrower, for obtaining my/our borrower, for obtaining credit information, and l/we shall not at any time raise any objection or dispute or claim against TMA or its officials if it accesses the database of CICs or such other repositories for obtaining my/our credit information within the above mentioned period.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">10) National Do Not Call Registry (\"NDNC\")Do Not Disturb (\"DND\"):</div>\n            <p>The mobile number and the e-mail address furnished above are in my/our exclusive control. I/we consent to TMA for de-registering my/our contact number in the NDNC and also to deactivate/de-register DND status of my/our contact number. I/we am/are aware that post de-registration of NDNC/DND, i/we may receive a call from TMA to verify the correctness of request. I/we am/are also aware that l/we have the right and option to re-register for DND/NDNC any time at my/discretion, after TMA deactivating/de-registering the DND/NDN status.</p>\n        </div>\n        \n        <div class=\"page-number\">Page 1 of 3</div>\n    </div>\n\n    <!-- Page 2 -->\n    <div class=\"page\">\n        \n        <div class=\"section\">\n            <div class=\"section-title\">11) Usage of Aadhaar Number/Biometric Information:</div>\n            <p><strong>(For Biometric):</strong> I/We voluntaryly give my/our consent to TMA to use my/our Aadhar number and biometic infomation for doing authentication with Unique ldentification Authority of lndia (UIDAI), for establishing my/our identity, in the manner acceptable as per UIDAI guidelines or under any Act or Law in force from time to time, for the purpose of opening account in relation to the loan or processing loan application or instructions with TMA. TMA has informed me/us that my/our Aadhaar number and biometric infomation will not be stored/shared/used by TMA for any other purpose, unless the same is required or permitted submitted by me/us through the aadhaar is true and correct and I/we will not hold TMA responsible in case any incorrect information is provided by me/us. <strong>(For physical copy of Aadhaar):</strong> I/We hereby declare that I/we have voluntarily submitted my/our Aadhaar card/e-Aadhaar to TMA and request and authorise TMA to use the same as my/our ldentity and/or Address proof.</p>\n        </div>\n\n        <div class=\"section\">\n            <div class=\"section-title\">12) (Applicable for borrower(s)):</div>\n            <p>(a) I/We have had availed the credit facility (\"Loan\") from TMA, under the Joint Liability Group (JLG) loan program I/WE shall be jointly and severally liable to repay the loan along with interest thereon and other charges/ cost/ expenses as specified in the loan application and other related documents (collectively referred as \"Loan Document\"). The interest shall be levied on reducing balance basis. (b)guarantee obligations:- all the borrowers herein jointly and severally, unconditionally and irrevocably guarantee the group loan availed by each and every other borrower of the group under this agreement (group guarantee). Each borrower jointly and severally undertakes to repay the said group loan and hereby confirm have full knowledge of the transaction. All the parties hereby agree to be bound by and bide with the terms and conditions of the agreement all time henceforth. Until the group loan are repaid in full by each of the borrower. No borrower shall be relieved in any manner whatsoever from his/her obligations under this agreement, notwithstanding any pre closure, prepayment or recall of the Group loan. (c) Representation:- All the borrowers jointly and severally represent, warrant and acknowledge to Tejraj Micro Association that : (i) each are individually eligible to contract and that the borrowers is eligible to avail the group loan (ii) the Group loan shall ensure not to be utilized for any illegal, unlawful or immoral purpose our activities. (iii) they shall participate in all the activities of the group and perform the obligation in the manner specified by Tejraj Micro Association for the group. In no event without the prior consent from Tejraj Micro Association shall there be any reconstitution of the group at the sole discretion of the Tejraj Micro Association and with consent of the group members, the group may be reconstituted by adding or relieving any other members of Tejraj Micro Association.</p>\n        </div>\n\n        <div class=\"section\">\n            <p>The consent and authorization mentioned herein will be valid up to 6 (Six) months after the date of closure of the existing loan availed by the herein mentioned borrower(s). Unless TMA is notified prior to disbursement in writing, at such stage Loan and/or repeat loan andlor additional loan and/or top up loan is disbursed to each of the herein mentioned borrower, in the manner described in this document, the concerned borrower shall be deemed to have accepted the applicable terms and conditions governing the Loan and/or repeat loan and/or additional loan and/or top up loan and to comply with the same, and each one of us will be expressly stopped from claiming otherwise.</p>\n        </div>\n\n        <div class=\"section\">\n            <p>Each and single data/information shared by me/us (including those related to household income, expenditure, land holding, cost of plant and machinery or equipment, loan purpose, loan utilization and all other information given in the Forms) with the staff of TMA is/are true and correct in all respect. I/We also confirm that the data/information are inputted in the Forms in my/our presence and all the data/information are properly and correctly inputted in the appropriate fields in the Forms. Each one of us ls aware and acknowledge that any false/misleading information or suppression of any material fact will result in rejection of loan application (in case TMA finds so prior lo loan sanction) or recall of loan (in case TMA finds so after sanction of loan) and we shall also be liable for suitable other action, under law or otherwise. The mobile numbers and the e-mail addresses furnished above are in the respective exclusive control of each one of us and we shall intimate TMA promptly, in writing, about changes therein. The whole loan transactions referred to herein are with our express consent, permission and are fully within our knowledge. Each one of us shall jointly and severally indemnify and keep indemnified TMA, Its affiliates, successors assigns, officers and employees at all times, from and against all actions, demands, losses, cost and expenses whatsoever which TMA may at any time incur or sustain as a consequences of any negligence/mistake on my/our part or my/our non-compliance of any of the applicable terms and conditions, or because of providing to TMA any incorrect or incomplete information related to me/us.</p>\n        </div>\n\n        <div class=\"section\">\n            <p>Each one among us acknowledges that, we have been informed about our right, not to agree to any one of the above mentioned clauses, if we have objections therefor, and affixture of our respective signatures hereunder shall be treated as our agreement to the herein mentioned clauses. Each one of us also acknowledges that we have been informed about my/our right not to sign this document if I/we have disagreement with any clause/declaration discussed herein, and also about my/our right to revoke any or all consents given hereby, after serving due notice upon TMA, This document shall be an integral part of the Forms, and the Forms and this document should be construed accordingly. We request TMA to sanction the loans applied for in the names of each individual borrower mentioned herein.</p>\n        </div>\n\n        <div class=\"section\">\n            <p>Each one of us solemnly state and declare that the contents of the Forms and this document have been read over to each of us in the language known to us and we understand, accept and acknowledge the contents of the same.</p>\n        </div>\n\n        <div class=\"language-section\">\n            <p>हम मे से हर एक औपचारिक रूप से यह कहता और घोषणा करता है कि फॉर्म और इस दस्तऐवज की सामग्री को हम में से हर एक को ज्ञात और समझ मे आने वाली भाषा मे पढकर सुनाया गया है और हम इस सामग्री को समज गए है , इसके लिए सहमती देते है और इसे स्वीकार करते है ।</p>\n            <p>आमच्यापैकी प्रत्येकजण गंभीरपणे सांगतो आणि घोषित करतो की नमुना आणि या दस्तऐवजातील मजकूर आमच्यापैकी प्रत्येकाला ज्ञात असलेल्या भाषेत वाचण्यात आला आहे आणि आम्ही त्यातील मजकूर समजतो, स्वीकारतो आणि मान्य करतो.</p>\n        </div>\n        \n        <div class=\"page-number\">Page 2 of 3</div>\n    </div>\n\n    <!-- Page 3 -->\n    <div class=\"page\">\n        {# Borrower from Data field #}\n{% set borrower = doc.applicant_name %}\n\n{# Co-Borrower from Loan Member #}\n{% set coborrower = \"\" %}\n{% if doc.co_borrower %}\n    {% set coborrower = frappe.db.get_value(\"Loan Member\", doc.co_borrower, \"member_name\") %}\n{% endif %}\n\n       \n        <table class=\"signature-table\">\n            <tr>\n                <th></th>\n                <th>BORROWER 1</th>\n                <th>HOUSEHOLD MEMBERS</th>\n                <th>BORROWER 2</th>\n                <th>HOUSEHOLD MEMBERS</th>\n                <th>BORROWER 3</th>\n                <th>HOUSEHOLD MEMBERS</th>\n            </tr>\n            <tr>\n                <td><strong>NAME</strong></td>\n                <td>{{ borrower }}</td>\n                <td>{{ coborrower }}</td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <td><strong>SIGNATURE</strong></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <th></th>\n                <th>BORROWER 4</th>\n                <th>HOUSEHOLD MEMBERS</th>\n                <th>BORROWER 5</th>\n                <th>HOUSEHOLD MEMBERS</th>\n                <th>BORROWER 6</th>\n                <th>HOUSEHOLD MEMBERS</th>\n            </tr>\n            <tr>\n                <td><strong>NAME</strong></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <td><strong>SIGNATURE</strong></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <th></th>\n                <th>BORROWER 7</th>\n                <th>HOUSEHOLD MEMBERS</th>\n                <th>BORROWER 8</th>\n                <th>HOUSEHOLD MEMBERS</th>\n                <th>BORROWER 9</th>\n                <th>HOUSEHOLD MEMBERS</th>\n            </tr>\n            <tr>\n                <td><strong>NAME</strong></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <td><strong>SIGNATURE</strong></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <th></th>\n                <th>BORROWER 10</th>\n                <th>HOUSEHOLD MEMBERS</th>\n                <th></th>\n                <th></th>\n                <th></th>\n                <th></th>\n            </tr>\n            <tr>\n                <td><strong>NAME</strong></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n            <tr>\n                <td><strong>SIGNATURE</strong></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n                <td></td>\n            </tr>\n        </table>\n\n        <div class=\"footer\">\n    <div class=\"footer-left\"><strong>Place:-</strong> _______________</div>\n    <div class=\"footer-right\"><strong>Date:-</strong> _______________</div>\n</div>\n\n        \n        <div class=\"page-number\">Page 3 of 3</div>\n    </div>\n</body>\n</html>",
 "idx": 0,
 "line_breaks": 0,
 "margin_bottom": 15.0,
 "margin_left": 15.0,
 "margin_right": 15.0,
 "margin_top": 15.0,
 "modified": "2025-11-28 15:57:40.628655",
 "modified_by": "Administrator",
 "module": "Excel Loan Management",
 "name": "Group Declaration And Terms And Consition VERSION JAN 24",
 "owner": "Administrator",
 "page_number": "Hide",
 "pdf_generator": "wkhtmltopdf",
 "print_format_builder": 0,
 "print_format_builder_beta": 0,
 "print_format_for": "DocType",
 "print_format_type": "Jinja",
 "raw_printing": 0,
 "show_section_headings": 0,
 "standard": "Yes"
}